{
	"FlowerData": [{
		"url": "https://raw.githubusercontent.com/Hongwing/MiniApp/master/images/shui_xian.png",
		"name": "水仙花",
		"otherName": "凌波仙子、金盏银台、落神香妃、玉玲珑、金银台、天蒜",
		"category": "石蒜科多年生草本植物",
		"meaning": "水仙花在过年象征－－思念，表示团圆。中国水仙：万事如意、吉祥、美好、纯洁、高尚、纯洁的爱情、妇女德行。在西方，水仙花的意译便是'恋影花'，花语是坚贞的爱情，引申一下便是自省对爱情的诚挚。",
		"efficiency": "水仙花花香清郁，鲜花芳香油含量达0.20%-0.45%,经提炼可调制香精、香料；可配制香水，香皂及高级化妆品。水仙香精是香型配调中不可缺少的原料。水仙花清香隽永，采用水仙鲜花窨茶，制成高档水仙花茶，水仙乌龙茶等，茶气隽香、味甘醇。水仙以鳞茎入药，春秋采集，洗去泥沙，开水烫后，切片晒干或鲜用，有小毒。具有清热解毒，散结消肿等疗效。用于腮腺炎，痈疖疔毒初起红肿热痛等症。"
	},{
		"url": "https://raw.githubusercontent.com/Hongwing/MiniApp/master/images/bai_he.png",
		"name": "百合花",
		"otherName": "强瞿、番韭、山丹、倒仙",
		"category": "被子植物门",
		"meaning": "在中国百合具有百年好合美好家庭、伟大的爱之含意，有深深祝福的意义。受到百合花祝福的人具有单纯天真的性格，集众人宠爱于一身，不过光凭这一点并不能平静度过一生，必须具备自制力，抵抗外界的诱惑，才能保持不被污染的纯真。",
		"efficiency": "百合除含有蛋白质21.29%、脂肪12.43%、还原糖11.47%、淀粉1.61%，及钙、磷、铁、每百克含1.443毫克维生素B、21.2毫克维生素C等营养素外，还含有一些特殊的营养成分，如秋水仙碱等多种生物碱。这些成分综合作用于人体，不仅具有良好的营养滋补之功，而且还对秋季气候干燥而引起的多种季节性疾病有一定的防治作用。中医上讲鲜百合具有养心安神，润肺止咳的功效，对病后虚弱的人非常有益。"
	},{
		"url": "https://raw.githubusercontent.com/Hongwing/MiniApp/master/images/bi_an_hua.jpg",
		"name": "彼岸花",
		"otherName": "曼珠沙华",
		"category": "植物界石蒜科",
		"meaning": "彼岸花，花开彼岸，花开时看不到叶子，有叶子时看不到花，花叶两不相见，生生相错。因此，她在日本的花语是「悲伤的回忆」，在韩国的花语则是「相互思念」。曼珠沙华是开在冥界的一种花，也叫彼岸花。诅咒人们生生世世都不能在一起。 “彼岸花开一千年，叶落一千年，花叶永不见。情不为因果，缘注定生死。”象征生死两隔，永不相见。",
		"efficiency": "彼岸花，恶魔的温柔。传说中自愿投入地狱的花朵，被众魔遣回，但仍徘徊于黄泉路上，众魔不忍，遂同意让她开在此路上，给离开人界的魂们一个指引与安慰。"
	},{
		"url": "https://raw.githubusercontent.com/Hongwing/MiniApp/master/images/chu_ju.png",
		"name": "雏菊",
		"otherName": "马头兰花、延命菊，春菊、太阳菊",
		"category": "菊科植物",
		"meaning": "雏菊的花语是天真、和平、希望、纯洁的美以及深藏在心底的爱.",
		"efficiency": "雏菊又叫干菊、白菊，药用价值非常高。它还有挥发油、氨基酸和多种微量元素。其中，黄铜的含量比其他的菊花高32%到61%，锡的含量比其他菊花高八到五十倍。雏菊的叶为匙形丛生呈莲座状，密集矮生，颜色碧翠。从叶间抽出花葶，葶一花，错落排列，外观古朴，花朵娇小玲珑，色彩和谐。从叶间抽出花葶，葶一花，错落排列，外观古朴，花朵娇小玲珑，色彩和谐。早春开花，生气盎然，具有君子的风度和天真烂漫的风采.农学家张履祥，在其著作《补农书》中曾写道：“白菊性甘温，久服最有益，古人春食苗、夏食英、冬食根，有以也。每地棱头种一二株，取其花，可以减茶之半，茶性苦寒与苦菊同泡。"
	},{
		"url": "https://raw.githubusercontent.com/Hongwing/MiniApp/master/images/ding_xiang.jpg",
		"name": "丁香花",
		"otherName": "学名：Syringa Linn,百结花、紫丁香、华北丁香",
		"category": "木犀科丁香属落叶灌木",
		"meaning": "忧愁思念、光辉，寓意着爱情和暗结同心的希望。",
		"efficiency": "该属中有不少种类的花是提取香精，配制高级香料的原料；又枝叶繁茂、花色淡雅而清香，故庭园广为栽培供观赏，为庭园中之珍品。欧美对本属进行杂交育种已有近百年的历史，先后曾选育出数百个栽培品种。中国北京植物园也开展了此项研究，目前已培育成紫云 Syringe oblate cv. 'Ziyun'，罗蓝紫 S. oblata cv. 'Luolanzi'，香雪 S. oblate cv. 'Xiangxue', 春阁 S. vulgaris cv. 'Chun'ge' 等新品种。丁香属植物主要应用于园林观赏，因其具有独特的芳香、硕大繁茂之花序、优雅而调和的花色、丰满而秀丽的姿态，在观赏花木中早已享有盛名，已成为全世界园林中不可缺少的花木。可丛植于路边、草坪或向阳坡地，或与其他花木搭配栽植在林缘，也可在庭前、窗外孤植，或将各种丁香穿插配植，布置成丁香专类园。还宜盆栽，并是切花插瓶的良好材料。丁香对二氧化硫及氟化氢等多种有毒气体，都有较强的抗性，故又是工矿区等绿化、美化的良好材料。"
	},{
		"url": "https://raw.githubusercontent.com/Hongwing/MiniApp/master/images/feng_xin_zi.jpg",
		"name": "风信子",
		"otherName": "被子植物纲天门冬目风信子科",
		"category": "洋水仙、西洋水仙、五色水仙、时样锦",
		"meaning": "风信子花语：胜利、竞技、喜悦、爱意、幸福、浓情、倾慕、顽固、生命、得意、永远的怀念。紫色的风信子：悲伤、妒忌，忧郁的爱（得到我的爱，你一定会幸福快乐）、道歉(对不起，请原谅我）、后悔。蓝色的风信子：恒心、贞操、彷佛见到你一样高兴、高贵浓郁。淡绿风信子：如果你想没有秘密，必先拥有善良的心。象征：只要点燃生命之火，便可同享丰富人生;重生的爱，忘记过去的悲伤，开始崭新的爱。",
		"efficiency": "传说英俊潇洒的美少年海新瑟斯和太阳神阿波罗是好朋友，而西风之神杰佛瑞斯也很喜欢海新瑟斯，且常为此吃醋，但海新瑟斯总是较喜欢阿波罗且经常和他一起玩乐。有一天，当他们正兴高采烈地在草原上掷铁饼，恰巧被躲在树丛中的杰佛瑞斯发现了，心里很不舒服，想捉弄他们一番。当阿波罗将铁饼掷向海新瑟斯之际，嫉妒的西风之神偷偷地在旁边用力一吹，竟将那沉甸甸的铁饼打在海新瑟斯的额头上，一时之间血流如柱，这名英俊的少年也因此一命呜呼了。阿波罗惊慌之余，心痛地抱起断了气的朋友' 唉！唉！'（Ai！Ai！）地叹着气，只见由海新瑟斯的伤口不断地涌出鲜血，落到地面上并流进草丛里。不久之后，草丛间竟开出串串的紫色花，阿波罗为了表示歉意，乃以美少年之名当作花名，我们则直译为----风信子。紫色的风信子从此被后人认为是'嫉妒'的代言者；希腊语Ai和Aei（永远）同义，所以风信子也象征'永远的怀念'，欧美人常将风信子的花样雕刻在亲人的墓碑上，以示'永久的怀念'。"
	},{
		"url": "https://raw.githubusercontent.com/Hongwing/MiniApp/master/images/gou_wei_ba_cao.jpg",
		"name": "狗尾巴草",
		"otherName": "阿罗汉草、稗子草、狗尾草",
		"category": "禾本科",
		"meaning": "坚忍、不被人了解的、艰难的爱，暗恋。把三支狗尾巴草编成麻花辫状，遍成一条，根据手指的大小，然后弯个圈打成结，带到手指上，代表私定终身",
		"efficiency": "狗尾巴草是仙女下凡时，从天上带下来的爱犬化作的。仙女在人间和一位书生相恋，但却遭到王母娘娘的阻挠，仙女和书生为了在一起，不惜反抗王母娘娘。在对抗的最后的时刻，仙女的爱犬为了救助人而不惜舍弃自己的性命。最终仙女和书生化作了阴阳两块玉佩，在人世间流传。相传相恋的两个人，如果分别获得这两块玉佩，便能有情人终成眷属。仙女的爱犬死后则化作了狗尾巴草，世世代代，传承着对爱情的见证。狗尾巴草秆、叶可作饲料，是牛驴马羊爱吃的植物。秋季的干草还可以作燃料生火烧水做饭，取暖铺床。小穗可提炼糠醛，全草含粗脂肪2.6%，粗蛋白10.27%，无氮浸出物34.55%，粗纤维34.40%，粗灰分10.60%。[1]  全草加水煮沸20分钟后，滤出液可喷杀菜虫。清热利湿；祛风明目；解毒；杀虫。主风热感冒；黄疸；小儿疳积；痢疾；小便涩痛；目赤涩痛；目赤肿痛；痈肿；寻常疣；疮癣。"
	},{
		"url": "https://raw.githubusercontent.com/Hongwing/MiniApp/master/images/ji_geng_hua.jpg",
		"name": "吉梗花",
		"otherName": "僧冠帽、铃铛花",
		"category": "属桔梗科桔梗属的多年生宿根草本花贲",
		"meaning": "永恒的爱，无望的爱。不变的爱，诚实，柔顺，悲哀。 永世不忘的爱(红色).",
		"efficiency": "日本以紫色代表桔梗，朝鲜以桔梗为清高。桔梗花的紫中带蓝，蓝中见紫，清心爽目，给人以宁静、幽雅、淡泊、舒适的享受。在百花圆中，别具一景，被誉为'花中处士、不慕繁华'，与红花相配，有'出类拔萃'之感，为优美的切花，广泛应用于花蓝，花束，一枚桔梗，可增添插花的观赏效果。也可作盆栽花或地植于花径、花坛。根为著名中药，可医治伤风、咳嗽、祛痰和助消化，嫩根可供食用，过去多栽培作药用，近年已开发作切花，花药并用，很有发展前景"
	},{
		"url": "https://raw.githubusercontent.com/Hongwing/MiniApp/master/images/jin_yu_cao.jpg",
		"name": "金鱼草",
		"otherName": "拉丁学名：（Antirrhinum majus L）.龙头花、狮子花、龙口花、洋彩雀",
		"category": "菊亚纲玄参目玄参科金鱼草属",
		"meaning": "金鱼草寓意有金有余，繁荣昌盛及活泼，是一种吉祥的花卉。",
		"efficiency": "金鱼草是夏秋开放之花，在中国园林广为栽种，适合群植于花坛、花境，与百日草、矮牵牛、万寿菊、一串红等配置效果尤佳。高性品种可用作背景种植，矮性品种宜棺岩石阋或窗台花池，或边缘种棺。此花亦可做切花之用。"
	},{
		"url": "https://raw.githubusercontent.com/Hongwing/MiniApp/master/images/kang_nai_xin.jpg",
		"name": "康乃馨",
		"otherName": "原名：香石竹，英文名：Dianthus caryophyllus.又名：狮头石竹、麝香石竹、大花石竹，拉丁文名：Dianthus caryophyllus L.",
		"category": "石竹属植物",
		"meaning": "康乃馨，大部分代表了爱，魅力和尊敬之情，红色代表了爱和关怀。粉红色康乃馨传说是圣母玛利亚看到耶稣受到苦难流下伤心的泪水，眼泪掉下的地方就长出来康乃馨，因此粉红康乃馨成为了不朽的母爱的象征。与玫瑰所不同的，康乃馨代表的爱表现为比较清淡和温馨，适于形容亲情之爱，所以儿女多献康乃馨给自己的双亲。热情、魅力、使人柔弱的爱、真情、母亲我爱你、温馨的祝福、热爱着你、温馨、慈祥、不求代价的母爱、宽容、母亲之花、浓郁的亲情、女性之爱、亲情思念、清纯的爱慕之情、热恋、热心、伤心与懊悔、痛苦、伟大，神圣，慈祥，温馨的母亲、慰问、心灵的相通、真挚、走运。白色：甜美而可爱、天真无邪、纯洁的爱、给女性带来好运气的礼物、纯洁、纯洁的友谊、我活生生的爱情、吾爱永在、信念、雅致的爱、真情、尊敬；粉色：永远不会忘了你、美丽、年青、热爱、祝母亲永远年轻美丽；感动、亮丽、母爱、女性的爱、我热烈地爱着你；红色：心为你而痛、赞赏、崇拜、迷恋、亲情、热烈的爱、热情、受伤的心、思念、相信你的爱、祝母亲健康长寿、祝你健康；黄色：你让我感到失望、抛弃、藐视、长久的友谊、对母亲的感谢之恩、拒绝、侮讳、侮蔑、永远感谢、友谊深厚；米红色：伤感；有斑纹的：拒绝、我不能和你在一起；有条纹的：对不起。",
		"efficiency": "康乃馨具有美容养颜，安神止渴，清心明目，消炎除烦，生津润喉，健胃消积。对治疗头痛牙痛有明显疗效。含人体所需的各种微量元素，能加速血液循环，促进新陈代谢，具有清心除燥，排毒养颜，调节内分泌，同时具有固肾益精，治虚劳，咳嗽、消渴之功效。清肝凉血，美白皮肤，祛斑除皱。能改善血液循环、增强肌体的新陈代谢，具有清心除燥、排毒养颜、延缓衰老、调节女性内分泌系统、补肾担神、健胃开胃、调节血脂减肥等功效。"
	},{
		"url": "https://raw.githubusercontent.com/Hongwing/MiniApp/master/images/pu_gong_ying.jpg",
		"name": "蒲公英",
		"otherName": "华花郎、蒲公草、食用蒲公英、尿床草、西洋蒲公英、婆婆丁",
		"category": "属多年生草本植物",
		"meaning": "有着充满朝气的黄色花朵，花语是“无法停留的爱”。紫蒲公英：呈淡紫色的蒲公英，花语是‘传说的紫色，属性暗。传说谁能找到紫色的蒲公英，谁就能得到完美的爱情。请注意：事实上蒲公英没有紫色的，所谓-紫色蒲公英是指大蓟。秋蒲公英的花朵蕴含着丰富的花蜜，因此每当开花时节，蜜蜂会蜂拥而至。所以它的花语是'诱惑'。飞箭蒲公英：冠以飞箭之名的蒲公英，花语是'瞄准弹珠'，属性风.据说谁能找到紫色的蒲公英谁就能得到完美的爱情。",
		"efficiency": "腌泡的蒲公英花蕾，经常吃具有提神醒脑的功效.蒲公英的根可以吃，也可以用来替代咖啡。"
	},{
		"url": "https://raw.githubusercontent.com/Hongwing/MiniApp/master/images/qian_niu_hua.jpg",
		"name": "牵牛花",
		"otherName": "朝颜、碗公花、牵牛花、喇叭花",
		"category": "属旋花科牵牛属，一年生缠绕草本",
		"meaning": "牵牛花为8月6日的生日花,牵牛花的花语：名誉/爱情永固.牵牛花花占卜：性情，却喜欢模仿大人的精明干练，使您看来非常有趣。您很有异性缘，喜欢追求大人们成熟的爱情，但入世未深的您又如何体会成年人的世界呢？还是放自然一点吧，您的心会更自在。牵牛花花箴言：小鬼扮大人，装腔作势。牵牛花花寓意：年长女性引诱年少男性。古有老牛吃嫩草这一说，今有老草牵嫩牛相对。见到类似女子，你可以说一句：哎哟，你是牵牛花吧。",
		"efefficiency": "除栽培供观赏外，种子为常用中药，名丑牛子（云南）、黑丑、白丑、二丑（黑、白种子混合），入药多用黑丑，白丑较少用。有泻水利尿，逐痰，杀虫的功效。除栽培供观赏外，种子为常用中药，名丑牛子（云南）、黑丑、白丑、二丑（黑、白种子混合），入药多用黑丑，白丑较少用。有泻水利尿，逐痰，杀虫的功效。"
	}
	]
}
